Project/Toir/src/Catalogs/торо_ТиповыеДефектыОборудования/торо_ТиповыеДефектыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТиповыеДефектыОборудования</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.торо_НаправленияОбъектовРемонтныхРабот</owners>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДефекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследствиеДефекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныВозникновенияДефекта</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ТиповыеДефектыОборудования/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств (Объект, Параметры.ЗначенияЗаполнения);
		Если Параметры.ЗначенияЗаполнения.Свойство("ДефектПричина")Тогда 
			Объект.ПричиныВозникновенияДефекта.Очистить();  
			Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ДефектПричина) Тогда 
				Объект.ПричиныВозникновенияДефекта.Добавить().Причина = Параметры.ЗначенияЗаполнения.ДефектПричина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч (Параметры.Ключ) = Тип ("СправочникСсылка.торо_ТиповыеДефектыОборудования") И Параметры.ЗначенияЗаполнения.Количество()>0 Тогда 
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ВладелецФормы <> Неопределено Тогда
		СтруктураОповещения = ПолучитьСтруктуруОповещения();
		ЗакрыватьПриВыборе = Ложь;
		ОповеститьОВыборе(СтруктураОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьСтруктуруОповещения()
	Результат = Новый Структура;
	Результат.Вставить("Дефект", Объект.Ссылка);
	Результат.Вставить("ВидДефекта", Объект.ВидДефекта);
	Результат.Вставить("КритичностьДефекта", Объект.КритичностьДефекта);
	Результат.Вставить("ПричинаДефекта", ?(Объект.ПричиныВозникновенияДефекта.Количество() = 0, Неопределено, Объект.ПричиныВозникновенияДефекта[0].Причина));
	Результат.Вставить("ДефектОписание", Объект.ОписаниеДефекта);
	Результат.Вставить("ПоследствияДефекта", Объект.ПоследствиеДефекта);
	Результат.Вставить("НаправлениеНаУстранение", Объект.НаправлениеНаУстранение);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти
